3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (6.5 0 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
		freestreamValue	$internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    plate
    {
        type            noSlip;
    }

    symmTop
    {
        type            symmetryPlane;
    }
    symmBottom
    {
        type            symmetryPlane;
    }
	

}

// ************************************************************************* //
