3/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue	$internalField;
		// type            fixedValue;
        // value		 	uniform 0;
    }

    plate
    {
        type            zeroGradient;
    }

    symmTop
    {
        type            symmetryPlane;
    }
    symmBottom
    {
        type            symmetryPlane;
    }
	
}

// ************************************************************************* //
