3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;		// 0.1 for centimeters, 0.01 for milimeters

x0 -0.5;
x1 0;
x2 1.1;
y0 0;
y1 0.5;
z0 -0.1;
z1 0.1;

N 100;		// streamwise number of cells of the first mesh
N1 220;		// streamwise number of cells of the second mesh
N2	100; 			// perpendicular number of cells 
G 200;

vertices
(
	($x0 $y0 $z0)	// 0
	($x0 $y0 $z1)	// 1
	($x1 $y0 $z0)	// 2
	($x1 $y0 $z1)	// 3
	($x1 $y1 $z0)	// 4
	($x1 $y1 $z1)	// 5
	($x0 $y1 $z0)	// 6
	($x0 $y1 $z1)	// 7
	($x2 $y0 $z0)	// 8 
	($x2 $y0 $z1)	// 9
	($x2 $y1 $z0)	// 10
	($x2 $y1 $z1)	// 11
);

blocks
(
    hex (0 2 4 6 1 3 5 7) ($N $N2 1) simpleGrading (1 $G 1)
	hex (2 8 10 4 3 9 11 5) ($N1 $N2 1) simpleGrading (2 $G 1)
	

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 1 7 6)
			
        );
    }
    outlet
    {
        type patch;
        faces
        (
			(8 10 11 9)
			
        );
    }
    plate
    {
        type wall;
        faces
        (
			(2 8 9 3)
			
        );
    }
	
    symmTop
    {
        type symmetryPlane;
        faces
        (
			(6 7 5 4)
			(4 5 11 10)
			
        );
    }
	
	symmBottom
    {
        type symmetryPlane;
        faces
        (
			(0 2 3 1)
        );
    }
		
    frontAndBack
    {
        type empty;
        faces
        (
            (0 6 4 2)
			(2 4 10 8)
			(1 3 5 7)
			(5 3 9 11)
        );
    }

	
);


// ************************************************************************* //
